const Projects = () => {

    return (
        <section id='projects' className='bg-old-rose'>
            <div className='text-center text-[32px] sm:text-[64px] text-white'>PROJECTS</div>
            <div className="flex flex-wrap gap-12 justify-center pt-[40px] pb-[40px]">
                {/* Project 1 */}
                <div className='flex flex-col justify-center w-[320px] h-[400px] sm:w-[600px] sm:h-[600px] bg-melon rounded-xl'>
                    <div className='sm:text-[24px] text-center text-white pb-4 pt-4'>멈추지 않을 당신의 걸음을 위한 맞춤형 서비스</div>
                    <div className='flex p-2 sm:p-4'>
                        <img src="/images/pirogramming_project.png" className='w-[40%] h-full' alt='프로젝트1' />
                        <div className='flex flex-col pl-4 justify-between items-center gap-[20px] text-[12px] sm:text-[24px] text-white'>
                            <div>걸음걸이</div>
                            <div>5人 프로젝트</div>
                            <div>2025.01.27-2025.02.18</div>
                            <div className='flex flex-wrap justify-center gap-4'>
                                <div className="p-2 bg-paynes-grey rounded-full text-center">HTML5</div>
                                <div className="p-2 bg-paynes-grey rounded-full text-center">CSS3</div>
                                <div className="p-2 bg-paynes-grey rounded-full text-center">JavaScript</div>
                                <div className="p-2 bg-paynes-grey rounded-full text-center">Python</div>
                                <div className="p-2 bg-paynes-grey rounded-full text-center">Django</div>
                                <div className="p-2 bg-paynes-grey rounded-full text-center">MySQL</div>
                            </div>
                            <a href='https://github.com/pirogramming/geol-eum-geol-i' className="w-15 h-15">
                                <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 640 640"><path d="M237.9 461.4C237.9 463.4 235.6 465 232.7 465C229.4 465.3 227.1 463.7 227.1 461.4C227.1 459.4 229.4 457.8 232.3 457.8C235.3 457.5 237.9 459.1 237.9 461.4zM206.8 456.9C206.1 458.9 208.1 461.2 211.1 461.8C213.7 462.8 216.7 461.8 217.3 459.8C217.9 457.8 216 455.5 213 454.6C210.4 453.9 207.5 454.9 206.8 456.9zM251 455.2C248.1 455.9 246.1 457.8 246.4 460.1C246.7 462.1 249.3 463.4 252.3 462.7C255.2 462 257.2 460.1 256.9 458.1C256.6 456.2 253.9 454.9 251 455.2zM316.8 72C178.1 72 72 177.3 72 316C72 426.9 141.8 521.8 241.5 555.2C254.3 557.5 258.8 549.6 258.8 543.1C258.8 536.9 258.5 502.7 258.5 481.7C258.5 481.7 188.5 496.7 173.8 451.9C173.8 451.9 162.4 422.8 146 415.3C146 415.3 123.1 399.6 147.6 399.9C147.6 399.9 172.5 401.9 186.2 425.7C208.1 464.3 244.8 453.2 259.1 446.6C261.4 430.6 267.9 419.5 275.1 412.9C219.2 406.7 162.8 398.6 162.8 302.4C162.8 274.9 170.4 261.1 186.4 243.5C183.8 237 175.3 210.2 189 175.6C209.9 169.1 258 202.6 258 202.6C278 197 299.5 194.1 320.8 194.1C342.1 194.1 363.6 197 383.6 202.6C383.6 202.6 431.7 169 452.6 175.6C466.3 210.3 457.8 237 455.2 243.5C471.2 261.2 481 275 481 302.4C481 398.9 422.1 406.6 366.2 412.9C375.4 420.8 383.2 435.8 383.2 459.3C383.2 493 382.9 534.7 382.9 542.9C382.9 549.4 387.5 557.3 400.2 555C500.2 521.8 568 426.9 568 316C568 177.3 455.5 72 316.8 72zM169.2 416.9C167.9 417.9 168.2 420.2 169.9 422.1C171.5 423.7 173.8 424.4 175.1 423.1C176.4 422.1 176.1 419.8 174.4 417.9C172.8 416.3 170.5 415.6 169.2 416.9zM158.4 408.8C157.7 410.1 158.7 411.7 160.7 412.7C162.3 413.7 164.3 413.4 165 412C165.7 410.7 164.7 409.1 162.7 408.1C160.7 407.5 159.1 407.8 158.4 408.8zM190.8 444.4C189.2 445.7 189.8 448.7 192.1 450.6C194.4 452.9 197.3 453.2 198.6 451.6C199.9 450.3 199.3 447.3 197.3 445.4C195.1 443.1 192.1 442.8 190.8 444.4zM179.4 429.7C177.8 430.7 177.8 433.3 179.4 435.6C181 437.9 183.7 438.9 185 437.9C186.6 436.6 186.6 434 185 431.7C183.6 429.4 181 428.4 179.4 429.7z" /></svg>
                            </a>
                        </div>
                    </div>
                </div>
                {/* Project 2 */}
                <div className='flex flex-col justify-center w-[320px] h-[400px] sm:w-[600px] sm:h-[600px] bg-melon rounded-xl'>
                    <div className='sm:text-[24px] text-center text-white pb-4 pt-4'>성균관대 학우들을 위한 Online Judge 서비스</div>
                    <div className='flex justify-between items-center flex-col p-2 sm:p-4'>
                        <img src="/images/SKKUDING_project.png" className='w-[80%]' alt='프로젝트2' />
                        <div className='flex pl-4 justify-between items-center gap-[20px] text-[12px] sm:text-[24px] text-white pt-4'>
                            <div className='flex flex-col h-full justify-around items-center'>
                                <div>CODEDANG</div>
                                <div>단체 프로젝트 (30人+)</div>
                                <div>2024.08 - 2025.08</div>
                            </div>
                            <div className='flex flex-col gap-4'>
                                <div className="bg-paynes-grey p-2 rounded-full text-center">TypeScript</div>
                                <div className="bg-paynes-grey p-2 rounded-full text-center">NestJS</div>
                                <div className="bg-paynes-grey p-2 rounded-full text-center">PostgreSQL</div>
                                <div className="bg-paynes-grey p-2 rounded-full text-center">RabbitMQ</div>
                            </div>
                            <div className='flex flex-col gap-10'>
                                <a href='https://github.com/skkuding/codedang' className="w-15 h-15">
                                    <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 640 640"><path d="M237.9 461.4C237.9 463.4 235.6 465 232.7 465C229.4 465.3 227.1 463.7 227.1 461.4C227.1 459.4 229.4 457.8 232.3 457.8C235.3 457.5 237.9 459.1 237.9 461.4zM206.8 456.9C206.1 458.9 208.1 461.2 211.1 461.8C213.7 462.8 216.7 461.8 217.3 459.8C217.9 457.8 216 455.5 213 454.6C210.4 453.9 207.5 454.9 206.8 456.9zM251 455.2C248.1 455.9 246.1 457.8 246.4 460.1C246.7 462.1 249.3 463.4 252.3 462.7C255.2 462 257.2 460.1 256.9 458.1C256.6 456.2 253.9 454.9 251 455.2zM316.8 72C178.1 72 72 177.3 72 316C72 426.9 141.8 521.8 241.5 555.2C254.3 557.5 258.8 549.6 258.8 543.1C258.8 536.9 258.5 502.7 258.5 481.7C258.5 481.7 188.5 496.7 173.8 451.9C173.8 451.9 162.4 422.8 146 415.3C146 415.3 123.1 399.6 147.6 399.9C147.6 399.9 172.5 401.9 186.2 425.7C208.1 464.3 244.8 453.2 259.1 446.6C261.4 430.6 267.9 419.5 275.1 412.9C219.2 406.7 162.8 398.6 162.8 302.4C162.8 274.9 170.4 261.1 186.4 243.5C183.8 237 175.3 210.2 189 175.6C209.9 169.1 258 202.6 258 202.6C278 197 299.5 194.1 320.8 194.1C342.1 194.1 363.6 197 383.6 202.6C383.6 202.6 431.7 169 452.6 175.6C466.3 210.3 457.8 237 455.2 243.5C471.2 261.2 481 275 481 302.4C481 398.9 422.1 406.6 366.2 412.9C375.4 420.8 383.2 435.8 383.2 459.3C383.2 493 382.9 534.7 382.9 542.9C382.9 549.4 387.5 557.3 400.2 555C500.2 521.8 568 426.9 568 316C568 177.3 455.5 72 316.8 72zM169.2 416.9C167.9 417.9 168.2 420.2 169.9 422.1C171.5 423.7 173.8 424.4 175.1 423.1C176.4 422.1 176.1 419.8 174.4 417.9C172.8 416.3 170.5 415.6 169.2 416.9zM158.4 408.8C157.7 410.1 158.7 411.7 160.7 412.7C162.3 413.7 164.3 413.4 165 412C165.7 410.7 164.7 409.1 162.7 408.1C160.7 407.5 159.1 407.8 158.4 408.8zM190.8 444.4C189.2 445.7 189.8 448.7 192.1 450.6C194.4 452.9 197.3 453.2 198.6 451.6C199.9 450.3 199.3 447.3 197.3 445.4C195.1 443.1 192.1 442.8 190.8 444.4zM179.4 429.7C177.8 430.7 177.8 433.3 179.4 435.6C181 437.9 183.7 438.9 185 437.9C186.6 436.6 186.6 434 185 431.7C183.6 429.4 181 428.4 179.4 429.7z" /></svg>
                                </a>
                                <a href='https://codedang.com/'>
                                    <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 640 640"><path d="M451.5 160C434.9 160 418.8 164.5 404.7 172.7C388.9 156.7 370.5 143.3 350.2 133.2C378.4 109.2 414.3 96 451.5 96C537.9 96 608 166 608 252.5C608 294 591.5 333.8 562.2 363.1L491.1 434.2C461.8 463.5 422 480 380.5 480C294.1 480 224 410 224 323.5C224 322 224 320.5 224.1 319C224.6 301.3 239.3 287.4 257 287.9C274.7 288.4 288.6 303.1 288.1 320.8C288.1 321.7 288.1 322.6 288.1 323.4C288.1 374.5 329.5 415.9 380.6 415.9C405.1 415.9 428.6 406.2 446 388.8L517.1 317.7C534.4 300.4 544.2 276.8 544.2 252.3C544.2 201.2 502.8 159.8 451.7 159.8zM307.2 237.3C305.3 236.5 303.4 235.4 301.7 234.2C289.1 227.7 274.7 224 259.6 224C235.1 224 211.6 233.7 194.2 251.1L123.1 322.2C105.8 339.5 96 363.1 96 387.6C96 438.7 137.4 480.1 188.5 480.1C205 480.1 221.1 475.7 235.2 467.5C251 483.5 269.4 496.9 289.8 507C261.6 530.9 225.8 544.2 188.5 544.2C102.1 544.2 32 474.2 32 387.7C32 346.2 48.5 306.4 77.8 277.1L148.9 206C178.2 176.7 218 160.2 259.5 160.2C346.1 160.2 416 230.8 416 317.1C416 318.4 416 319.7 416 321C415.6 338.7 400.9 352.6 383.2 352.2C365.5 351.8 351.6 337.1 352 319.4C352 318.6 352 317.9 352 317.1C352 283.4 334 253.8 307.2 237.5z" /></svg>
                                </a>
                            </div>
                        </div>
                    </div>
                </div>
                {/* Project 3 */}
                <div className='flex flex-col justify-center w-[320px] h-[400px] sm:w-[600px] sm:h-[600px] bg-melon rounded-xl'>
                    <div className='sm:text-[24px] text-center text-white pb-4 pt-4'>프로골프투어에 필요한 종합 온라인 플랫폼</div>
                    <div className='flex justify-between items-center flex-col p-2 sm:p-4'>
                        <img src="/images/SKKUDING_project.png" className='w-[80%]' alt='프로젝트2' />
                        <div className='flex pl-4 justify-between items-center gap-[20px] text-[12px] sm:text-[24px] text-white pt-4'>
                            <div className='flex flex-col h-full justify-around items-center'>
                                <div>Spoeum</div>
                                <div>5人 프로젝트</div>
                                <div>2025.04 - 2025.12</div>
                            </div>
                            <div className='flex flex-wrap flex-col gap-4'>
                                <div className="bg-paynes-grey p-2 rounded-full text-center">TypeScript</div>
                                <div className="bg-paynes-grey p-2 rounded-full text-center">NestJS</div>
                                <div className="bg-paynes-grey p-2 rounded-full text-center">MySQL</div>
                                <div className="bg-paynes-grey p-2 rounded-full text-center">React</div>
                            </div>
                            <a href="" className='w-15 h-15'>
                                <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 640 640"><path d="M451.5 160C434.9 160 418.8 164.5 404.7 172.7C388.9 156.7 370.5 143.3 350.2 133.2C378.4 109.2 414.3 96 451.5 96C537.9 96 608 166 608 252.5C608 294 591.5 333.8 562.2 363.1L491.1 434.2C461.8 463.5 422 480 380.5 480C294.1 480 224 410 224 323.5C224 322 224 320.5 224.1 319C224.6 301.3 239.3 287.4 257 287.9C274.7 288.4 288.6 303.1 288.1 320.8C288.1 321.7 288.1 322.6 288.1 323.4C288.1 374.5 329.5 415.9 380.6 415.9C405.1 415.9 428.6 406.2 446 388.8L517.1 317.7C534.4 300.4 544.2 276.8 544.2 252.3C544.2 201.2 502.8 159.8 451.7 159.8zM307.2 237.3C305.3 236.5 303.4 235.4 301.7 234.2C289.1 227.7 274.7 224 259.6 224C235.1 224 211.6 233.7 194.2 251.1L123.1 322.2C105.8 339.5 96 363.1 96 387.6C96 438.7 137.4 480.1 188.5 480.1C205 480.1 221.1 475.7 235.2 467.5C251 483.5 269.4 496.9 289.8 507C261.6 530.9 225.8 544.2 188.5 544.2C102.1 544.2 32 474.2 32 387.7C32 346.2 48.5 306.4 77.8 277.1L148.9 206C178.2 176.7 218 160.2 259.5 160.2C346.1 160.2 416 230.8 416 317.1C416 318.4 416 319.7 416 321C415.6 338.7 400.9 352.6 383.2 352.2C365.5 351.8 351.6 337.1 352 319.4C352 318.6 352 317.9 352 317.1C352 283.4 334 253.8 307.2 237.5z" /></svg>
                            </a>
                        </div>
                    </div>
                </div>
                {/* Project 4 */}
                <div className='flex flex-col justify-center w-[320px] h-[400px] sm:w-[600px] sm:h-[600px] bg-melon rounded-xl'>
                    <div className='sm:text-[24px] text-center text-white pb-4 pt-4'>자기소개를 위한 포트폴리오</div>
                    <div className='flex justify-between items-center flex-col p-2 sm:p-4'>
                        <img src="/images/Portfolio_project.png" className='w-[70%] border border-white' alt='프로젝트2' />
                        <div className='flex pl-4 justify-between items-center gap-[20px] text-[12px] sm:text-[24px] text-white pt-4'>
                            <div className='flex flex-col h-full justify-around items-center'>
                                <div>PGW Portfolio</div>
                                <div>개인 프로젝트</div>
                                <div>2025.08 -</div>
                            </div>
                            <div className='flex flex-wrap flex-col gap-4'>
                                <div className="bg-paynes-grey p-2 rounded-full text-center">TypeScript</div>
                                <div className="bg-paynes-grey p-2 rounded-full text-center">React</div>
                            </div>
                            <a href='https://github.com/parkgunwook0617/Portfolio' className='w-15 h-15'>
                                <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 640 640"><path d="M237.9 461.4C237.9 463.4 235.6 465 232.7 465C229.4 465.3 227.1 463.7 227.1 461.4C227.1 459.4 229.4 457.8 232.3 457.8C235.3 457.5 237.9 459.1 237.9 461.4zM206.8 456.9C206.1 458.9 208.1 461.2 211.1 461.8C213.7 462.8 216.7 461.8 217.3 459.8C217.9 457.8 216 455.5 213 454.6C210.4 453.9 207.5 454.9 206.8 456.9zM251 455.2C248.1 455.9 246.1 457.8 246.4 460.1C246.7 462.1 249.3 463.4 252.3 462.7C255.2 462 257.2 460.1 256.9 458.1C256.6 456.2 253.9 454.9 251 455.2zM316.8 72C178.1 72 72 177.3 72 316C72 426.9 141.8 521.8 241.5 555.2C254.3 557.5 258.8 549.6 258.8 543.1C258.8 536.9 258.5 502.7 258.5 481.7C258.5 481.7 188.5 496.7 173.8 451.9C173.8 451.9 162.4 422.8 146 415.3C146 415.3 123.1 399.6 147.6 399.9C147.6 399.9 172.5 401.9 186.2 425.7C208.1 464.3 244.8 453.2 259.1 446.6C261.4 430.6 267.9 419.5 275.1 412.9C219.2 406.7 162.8 398.6 162.8 302.4C162.8 274.9 170.4 261.1 186.4 243.5C183.8 237 175.3 210.2 189 175.6C209.9 169.1 258 202.6 258 202.6C278 197 299.5 194.1 320.8 194.1C342.1 194.1 363.6 197 383.6 202.6C383.6 202.6 431.7 169 452.6 175.6C466.3 210.3 457.8 237 455.2 243.5C471.2 261.2 481 275 481 302.4C481 398.9 422.1 406.6 366.2 412.9C375.4 420.8 383.2 435.8 383.2 459.3C383.2 493 382.9 534.7 382.9 542.9C382.9 549.4 387.5 557.3 400.2 555C500.2 521.8 568 426.9 568 316C568 177.3 455.5 72 316.8 72zM169.2 416.9C167.9 417.9 168.2 420.2 169.9 422.1C171.5 423.7 173.8 424.4 175.1 423.1C176.4 422.1 176.1 419.8 174.4 417.9C172.8 416.3 170.5 415.6 169.2 416.9zM158.4 408.8C157.7 410.1 158.7 411.7 160.7 412.7C162.3 413.7 164.3 413.4 165 412C165.7 410.7 164.7 409.1 162.7 408.1C160.7 407.5 159.1 407.8 158.4 408.8zM190.8 444.4C189.2 445.7 189.8 448.7 192.1 450.6C194.4 452.9 197.3 453.2 198.6 451.6C199.9 450.3 199.3 447.3 197.3 445.4C195.1 443.1 192.1 442.8 190.8 444.4zM179.4 429.7C177.8 430.7 177.8 433.3 179.4 435.6C181 437.9 183.7 438.9 185 437.9C186.6 436.6 186.6 434 185 431.7C183.6 429.4 181 428.4 179.4 429.7z" /></svg>
                            </a>
                        </div>
                    </div>
                </div>
            </div>
        </section>
    )
}

export default Projects;